import verifyCodeConstant from "./verifyCodeConstant"

const faTextConstant = {
    back: "بازگشت",

    submitBtn: "ثبت",

    chooseGallery: "انتخاب از گالری",
    chooseCamera: "باز کردن دوربین",
    removeAvatar: "حذف تصویر",

    next: "بعدی",
    letsGo: "برو بریم",

    sendCodeAgain: "ارسال مجدد کد",

    continueBtn: "ادامه",
    submitAndContinueBtn: "ثبت و ادامه",
    closeBtn: "بستن",

    entering: `ورود به ${process.env.REACT_APP_NAME}`,
    enterPhone: "پدر مادر عزیز! شماره موبایلتان را وارد کنید!",

    onBoardingTitle1: "بهمون بگو چند سالشه؟",
    onBoardingTitle2: "هر چی بخوای این جا هست",
    onBoardingTitle3: `با آبنبات خیالتون راحته`,
    onBoardingDesc1: "تا بهتون بگیم محتوای مناسب سنش چیه",
    onBoardingDesc2: "بازی، فیلم، انیمیشن، موسیقی و دیدنی های آموزشی برای بچه‌ها",
    onBoardingDesc3: "چون با مدیریت سطح دسترسی‌های کودک، می‌تونید ازش مراقبت کنید",

    enterCode: "کد تاييد را وارد کنید",
    enterVerifyCode: `کد تاييد ${verifyCodeConstant.numberOfDigits} رقمی که به شماره همراه `,
    enterVerifyCodeEnd: " ارسال شد را در زیر وارد کنید.",
    editPhone: "ویرایش شماره",

    completeProfile: "تکمیل اطلاعات کاربری",
    completeProfileAfterSignup: "حساب شما با موفقیت ساخته شد، اطلاعات خود را کامل کنید.",
    childAccountInfo: "اطلاعات حساب فرزند",
    accountInfo: "اطلاعات حساب کاربری",
    editAvatar: "ویرایش تصویر پروفایل",
    lastName: "نام خانوادگی",
    fullName: "نام",
    email: "ایمیل",
    enterEmail: "ایمیل خود را وارد کنید",
    mobilePhone: "شماره همراه",
    nationalCode: "کدملی",
    enterNationalCode: "کد ملی 10 رقمی",
    gender: "جنسیت",
    chooseGender: "جنسیت خود را انتخاب کنید",
    birthDate: "تاریخ تولد",

    chooseChildGender: "جنسیت فرزند خود را انتخاب کنید",
    chooseChildBirthDate: "تاریخ تولد فرزند خود را انتخاب کنید",

    saveBtn: "ذخیره",
    skipBtn: "رد کردن",

    boy: "پسر",
    girl: "دختر",
    male: "مرد",
    female: "زن",

    hour: "ساعت",
    minute: "دقیقه",

    and: " و ",

    proposedPack: "بسته پیشنهادی",

    spaceHour: " ساعت",
    spaceMinute: " دقیقه",
    spaceSecond: " ثانیه",
    oneQuarter: "یک ربع ساعت",
    halfHour: "نیم ساعت",
    emptyTime: "0 دقیقه",

    noLimit: "بدون محدودیت",
    sameTimeForWeek: "زمان یکسان برای کل هفته",
    differentTimeForWeek: "زمان متفاوت برای هر روز هفته",
    manualSelect: "تنظیم دستی",
    manualSelectTitle: "تعیین زمان دستی",

    saturday: "شنبه",
    sunday: "یکشنبه",
    monday: "دوشنبه",
    tuesday: "سه‌شنبه",
    wednesday: "چهارشنبه",
    thursday: "پنجشنبه",
    friday: "جمعه",

    selectTimeRestriction: "مقدار فعالیت",
    selectTimeRestrictionDesc: "مقدار زمان فعالیت فرزند خود را مشخص کنید.",

    recommended: "پیشنهادی",
    manageApps: "مدیریت نرم‌افزارها",
    searchInApps: "جستجو در لیست اپلیکیشن‌ها",

    choosePackFirst: "لطفا ابتدا بسته فرزند خود را مشخص کنید.",

    noItemsFound: "موردی یافت نشد.",

    manageWeb: "مدیریت وبسایت‌ها",
    webAccessed: length => `دسترسی داده شده (${length})`,
    newWebAccess: "وبسایت جدید",

    addWeb: "وبسایت جدید",
    addWebDesc: "آدرس وبسایت جدید را وارد کنید",

    iRead: "خواندم",

    privacyIntro: "ورود شما به معنای پذیرش",
    privacyTitle: "قوانین حریم خصوصی",
    privacyEnd: "است.",
    privacyText: `**سیاست‌های حریم خصوصی آبنبات**
«آبنبات» برای حفظ حریم شخصی و اطلاعات کاربران احترام بسیار زیادی قائل است. از این رو در این سند توضیح می‌دهیم چه اطلاعاتی از شما را به چه دلیلی جمع‌آوری، چگونه از این اطلاعات استفاده و از آن محافظت می‌کنیم.
بر اساس این سند و در محدوده‌ی امکانات و توانایی‌هایمان به شما اطمینان می‌دهیم که از اطلاعاتی که به شکل مستقیم یا غیرمستقیم در اختیار ما قرار می‌دهید تنها به منظور دلایل بیان شده در این سند و ارائه‌ی خدمات بهتر به شما، استفاده خواهد شد.

**ما که هستیم؟**
«آبنبات» یک اپلیکیشن است که به کودک اجازه می‌دهد هنگام استفاده از تلفن همراه و اینترنت، تحت نظارت والدین، فقط و فقط به محتوای مناسب سن خودش، دسترسی داشته باشد. شما می‌توانید برای هر کدام از فرزندان 3-12 ساله‌‌ی خود، پروفایل جداگانه بسازید و زمان استفاده از گوشی، دسترسی به سایت‌ها و اپلیکیشن‌ها، امکان تماس با مخاطب‌های گوشی و... را برای هر فرزند به شکل جداگانه رصد و مدیریت کنید. «آبنبات» به شکل روزانه، هفتگی و ماهانه گزارشی از فعالیت‌های کودک در تلفن همراه و اینترنت، در اختیار والدین قرار می‌دهد تا پدر و مادر بتوانند با خیال راحت گوشی را در اختیار کودک قرار بدهند.

**چگونگی جمع‌آوری اطلاعات و شیوه‌ی استفاده از آن**

**اطلاعاتی که شما به شکل مستقیم در اختیار ما قرار می‌دهید**
بخشی از اطلاعاتی که در «آبنبات» ذخیره می‌شود، اطلاعاتی‌ست که شما به شکل مستقیم در فرآیند ثبت‌نام، تکمیل پروفایل خودتان و فرزندتان یا روش‌های مشابه در اپلیکیشن ثبت می‌کنید. مواردی مثل شماره تلفن همراه، نام، نام‌خانوادگی، تاریخ تولد، جنسیت، شماره‌ی ملی و نشانی پست الکترونیک اطلاعاتی از این دست به شمار می‌روند که از میان تنها وارد کردن شماره تلفن همراه اجباری‌ست و باقی اطلاعات را می‌توانید به شکل اختیاری وارد کنید.

**اطلاعات بعد از نصب اپلیکیشن**
بعد از نصب اپلیکیشن از شما خواسته می‌شود مجوز دسترسی به بعضی از قسمت‌ها را صادر کنید، برخی از این مجوزها اجباری‌ و برخی اختیاری‌ست. منظور از مجوز اجباری، دسترسی‌هایی است که بدون آن، استفاده از اپلیکیشن امکان‌پذیر نخواهد بود. در ادامه به دلیل درخواست هرکدام از مجوزها، اشاره می‌کنیم:

**دسترسی‌های اجباری**
• Accessibility: ما از این دسترسی به منظور جلوگیری از اجرای اپلکیشن‌های نامناسب در محیط کودک استفاده می‌کنیم. با دادن مجوز این دسترسی به «آبنبات» به ما کمک می‌کنید محیط شخصی‌سازی شده‌ی کودک را امن نگه داریم تا فقط به برنامه‌های مناسب و مُجازی که شما تعیین کرده‌اید، دسترسی داشته باشد.
• Appears on Top: با فعال کردن این گزینه به ما کمک می‌کنید تا دسترسی کودک را به فضای اختصاصی و شخصی‌سازی شده‌ی خودش محدود کنیم به شکلی که به اطلاعات گوشی شما دسترسی پیدا نکند.
• Run in background: با فعال کردن این گزینه، زمانی که کودک در محیط شخصی‌سازی شده‌ی خود در حال فعالیت است، اپلکیشن اجازه دارد در پس زمینه دسترسی‌های کودک را کنترل کند تا از فضای اختصاصی خود خارج نشود.

**دسترسی‌های اختیاری**
• دسترسی به Camera: با فعال کردن این گزینه، کودک در فضای اختصاصی خود می‌تواند از دوربین اختصاصی آبنبات که برای کودکان طراحی شده است، استفاده کند.
• دسترسی به Microphone: برای این که کودک بتواند از دوربین اختصاصی آبنبات استفاده کند لازم است اجازه‌ی دسترسی به میکروفون را فعال کنید.
• دسترسی به Files and Media: با فعال کردن این دسترسی امکان تغییر عکس پروفایل و انتخاب عکس از گالری گوشی را خواهید داشت.
• دسترسی به Contacts: ما از فهرست مخاطبان گوشی شما، به منظور ساخت دفترچه تلفن اختصاصی برای کودک استفاده می‌کنیم. مخاطبان دفترچه تلفن کودک، به تشخیص و صلاحدید والدین از لیست مخاطبان گوشی انتخاب می‌شوند.
• دسترسی به Phone: با فعال کردن این دسترسی، کودک می‌تواند بدون خارج شدن از محیط اختصاصی خود از اپ تماس استفاده کند و با مخاطب‌هایی که شما تعیین کرده‌اید تماس بگیرد.

**اطلاعات زمان استفاده‌ از اپلیکیشن**
برای استفاده از خدمات «آبنبات» بخشی از اطلاعات شما به ضرورت در سیستم ذخیره و نگهداری خواهد شد؛ این اطلاعات عبارتند از:
• رفتار شما در اپلیکیشن: آبنبات نحوه‌ی استفاده‌ی فرزندتان از اپلیکیشن را رصد و اطلاعات مربوط به آن را ذخیره می‌کند تا بتواند خدمات بهتری با کیفیت بیشتر به شما ارائه کند. همچنین از این اطلاعات برای ارسال نوتیفیکیشن، اطلاع‌رسانی و همچنین شخصی‌سازی سرویس و ارائه‌ی پیشنهادهای ویژه برای هر کاربر، استفاده خواهد شد.
• اطلاعات مربوط به دستگاه مورد استفاده و شبکه‌ی اینترنت: اطلاعات مربوط به دستگاهی که شما و فرزندتان از طریق آن از اپلیکیشن «آبنبات» استفاده می‌کنید برای سیستم قابل مشاهده است اما ما این اطلاعات را ذخیره و نگهداری نمی‌کنیم. این اطلاعات عبارتند از: نوع دستگاه (موبایل، تبلت، لپ‌تاپ و...) زبان، سیستم عامل، مشخصات سخت‌افزاری و همچنین اطلاعات مربوط به شیوه‌ی اتصال شما به اینترنت از جمله‌ شبکه‌ی 3G/4G، وای‌فای (WiFi).
• فهرست اپلکیشن‌های گوشی شما: ما از این فهرست برای تعیین سطح دسترسی کودک به اپلیکیشن‌های انتخابی شما، استفاده می‌کنیم.
• مدت زمان و بازه‌های استفاده از اپلکیشن: ما این اطلاعات را با هدف ارسال گزارش مدت زمانی که کودک از گوشی  و همچنین مدت زمانی که از هر اپلکیشن استفاده کرده، ذخیره می‌کنیم.

**نگهداری اطلاعات و حفظ حریم شخصی کاربران**
از تمام اطلاعات و دسترسی‌ها تنها برای ارتقاء خدمات و بهبود تجربه‌ی کاربری استفاده خواهد شد. همچنین اطلاعات شما با هیچ شخص حقیقی یا حقوقی غیرذیصلاح به اشتراک گذاشته نخواهد شد و تنها مراجع قانونی با ارائه‌ی حکم دادگاه می‌توانند به این اطلاعات دسترسی داشته باشند.
بدیهی‌ست که ما نهایت تلاش خود را جهت نگهداری و حفظ اطلاعات شما به کار می‌گیریم، اگرچه با توجه به واقعیت‌های حاکم بر فضای مجازی، همواره امکان خطر و درز اطلاعات وجود دارد. چنان‌چه با وجود تمام تلاش‌ها نتوانیم از این مساله جلوگیری کنیم، مسئولیتی متوجه ما نخواهد بود.

**تغییرات این سند**
ممکن است با به روز رسانی اپلیکیشن «آبنبات» محتوای این صفحه نیز به روز شود، تلاش ما این است که این موضوع را از طریق پیامک یا ایمیل، به اطلاع کاربران برسانیم اما شما همیشه می‌توانید با مراجعه به این صفحه از آخرین تغییرات مطلع شوید.`,
}

export default faTextConstant